Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1064dak176.h
extern volatile __ETHRXOVFLOWbits_t ETHRXOVFLOWbits __asm__ ("ETHRXOVFLOW") __attribute__((section("sfrs"), address(0xBF882100)));
extern volatile uint32_t        ETHRXOVFLOWCLR __attribute__((section("sfrs"),address(0xBF882104)));
extern volatile uint32_t        ETHRXOVFLOWSET __attribute__((section("sfrs"),address(0xBF882108)));
extern volatile uint32_t        ETHRXOVFLOWINV __attribute__((section("sfrs"),address(0xBF88210C)));
#define ETHFRMTXOK ETHFRMTXOK
extern volatile uint32_t   ETHFRMTXOK __attribute__((section("sfrs"), address(0xBF882110)));
typedef union {
  struct {
    uint32_t FRMTXOKCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFRMTXOKbits_t;
extern volatile __ETHFRMTXOKbits_t ETHFRMTXOKbits __asm__ ("ETHFRMTXOK") __attribute__((section("sfrs"), address(0xBF882110)));
extern volatile uint32_t        ETHFRMTXOKCLR __attribute__((section("sfrs"),address(0xBF882114)));
extern volatile uint32_t        ETHFRMTXOKSET __attribute__((section("sfrs"),address(0xBF882118)));
extern volatile uint32_t        ETHFRMTXOKINV __attribute__((section("sfrs"),address(0xBF88211C)));
#define ETHSCOLFRM ETHSCOLFRM
extern volatile uint32_t   ETHSCOLFRM __attribute__((section("sfrs"), address(0xBF882120)));
typedef union {
  struct {
    uint32_t SCOLFRMCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHSCOLFRMbits_t;
extern volatile __ETHSCOLFRMbits_t ETHSCOLFRMbits __asm__ ("ETHSCOLFRM") __attribute__((section("sfrs"), address(0xBF882120)));
extern volatile uint32_t        ETHSCOLFRMCLR __attribute__((section("sfrs"),address(0xBF882124)));
extern volatile uint32_t        ETHSCOLFRMSET __attribute__((section("sfrs"),address(0xBF882128)));
extern volatile uint32_t        ETHSCOLFRMINV __attribute__((section("sfrs"),address(0xBF88212C)));
#define ETHMCOLFRM ETHMCOLFRM
extern volatile uint32_t   ETHMCOLFRM __attribute__((section("sfrs"), address(0xBF882130)));
typedef union {
  struct {
    uint32_t MCOLFRMCNT:16;
  };
  struct {
    uint32_t MCOLFRM_CNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHMCOLFRMbits_t;
extern volatile __ETHMCOLFRMbits_t ETHMCOLFRMbits __asm__ ("ETHMCOLFRM") __attribute__((section("sfrs"), address(0xBF882130)));
extern volatile uint32_t        ETHMCOLFRMCLR __attribute__((section("sfrs"),address(0xBF882134)));
extern volatile uint32_t        ETHMCOLFRMSET __attribute__((section("sfrs"),address(0xBF882138)));
extern volatile uint32_t        ETHMCOLFRMINV __attribute__((section("sfrs"),address(0xBF88213C)));
#define ETHFRMRXOK ETHFRMRXOK
extern volatile uint32_t   ETHFRMRXOK __attribute__((section("sfrs"), address(0xBF882140)));
typedef union {
  struct {
    uint32_t FRMRXOKCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFRMRXOKbits_t;
extern volatile __ETHFRMRXOKbits_t ETHFRMRXOKbits __asm__ ("ETHFRMRXOK") __attribute__((section("sfrs"), address(0xBF882140)));
extern volatile uint32_t        ETHFRMRXOKCLR __attribute__((section("sfrs"),address(0xBF882144)));
extern volatile uint32_t        ETHFRMRXOKSET __attribute__((section("sfrs"),address(0xBF882148)));
extern volatile uint32_t        ETHFRMRXOKINV __attribute__((section("sfrs"),address(0xBF88214C)));
#define ETHFCSERR ETHFCSERR
extern volatile uint32_t   ETHFCSERR __attribute__((section("sfrs"), address(0xBF882150)));
typedef union {
  struct {
    uint32_t FCSERRCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFCSERRbits_t;
extern volatile __ETHFCSERRbits_t ETHFCSERRbits __asm__ ("ETHFCSERR") __attribute__((section("sfrs"), address(0xBF882150)));
extern volatile uint32_t        ETHFCSERRCLR __attribute__((section("sfrs"),address(0xBF882154)));
extern volatile uint32_t        ETHFCSERRSET __attribute__((section("sfrs"),address(0xBF882158)));
extern volatile uint32_t        ETHFCSERRINV __attribute__((section("sfrs"),address(0xBF88215C)));
#define ETHALGNERR ETHALGNERR
extern volatile uint32_t   ETHALGNERR __attribute__((section("sfrs"), address(0xBF882160)));
typedef union {
  struct {
    uint32_t ALGNERRCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHALGNERRbits_t;
extern volatile __ETHALGNERRbits_t ETHALGNERRbits __asm__ ("ETHALGNERR") __attribute__((section("sfrs"), address(0xBF882160)));
extern volatile uint32_t        ETHALGNERRCLR __attribute__((section("sfrs"),address(0xBF882164)));
extern volatile uint32_t        ETHALGNERRSET __attribute__((section("sfrs"),address(0xBF882168)));
extern volatile uint32_t        ETHALGNERRINV __attribute__((section("sfrs"),address(0xBF88216C)));
#define EMAC1CFG1 EMAC1CFG1
extern volatile uint32_t   EMAC1CFG1 __attribute__((section("sfrs"), address(0xBF882200)));
typedef union {
  struct {
    uint32_t RXENABLE:1;
    uint32_t PASSALL:1;
    uint32_t RXPAUSE:1;
    uint32_t TXPAUSE:1;
    uint32_t LOOPBACK:1;
    uint32_t :3;
    uint32_t RESETTFUN:1;
    uint32_t RESETTMCS:1;
    uint32_t RESETRFUN:1;
    uint32_t RESETRMCS:1;
    uint32_t :2;
    uint32_t SIMRESET:1;
    uint32_t SOFTRESET:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CFG1bits_t;
extern volatile __EMAC1CFG1bits_t EMAC1CFG1bits __asm__ ("EMAC1CFG1") __attribute__((section("sfrs"), address(0xBF882200)));
#define EMACxCFG1 EMACxCFG1
extern volatile uint32_t   EMACxCFG1 __attribute__((section("sfrs"), address(0xBF882200)));
typedef union {
  struct {
    uint32_t RXENABLE:1;
    uint32_t PASSALL:1;
    uint32_t RXPAUSE:1;
    uint32_t TXPAUSE:1;
    uint32_t LOOPBACK:1;
    uint32_t :3;
    uint32_t RESETTFUN:1;
    uint32_t RESETTMCS:1;
    uint32_t RESETRFUN:1;
    uint32_t RESETRMCS:1;
    uint32_t :2;
    uint32_t SIMRESET:1;
    uint32_t SOFTRESET:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCFG1bits_t;
extern volatile __EMACxCFG1bits_t EMACxCFG1bits __asm__ ("EMACxCFG1") __attribute__((section("sfrs"), address(0xBF882200)));
extern volatile uint32_t        EMAC1CFG1CLR __attribute__((section("sfrs"),address(0xBF882204)));
extern volatile uint32_t        EMACxCFG1CLR __attribute__((section("sfrs"),address(0xBF882204)));
extern volatile uint32_t        EMAC1CFG1SET __attribute__((section("sfrs"),address(0xBF882208)));
extern volatile uint32_t        EMACxCFG1SET __attribute__((section("sfrs"),address(0xBF882208)));
extern volatile uint32_t        EMAC1CFG1INV __attribute__((section("sfrs"),address(0xBF88220C)));
extern volatile uint32_t        EMACxCFG1INV __attribute__((section("sfrs"),address(0xBF88220C)));
#define EMAC1CFG2 EMAC1CFG2
extern volatile uint32_t   EMAC1CFG2 __attribute__((section("sfrs"), address(0xBF882210)));
typedef union {
  struct {
    uint32_t FULLDPLX:1;
    uint32_t LENGTHCK:1;
    uint32_t HUGEFRM:1;
    uint32_t DELAYCRC:1;
    uint32_t CRCENABLE:1;
    uint32_t PADENABLE:1;
    uint32_t VLANPAD:1;
    uint32_t AUTOPAD:1;
    uint32_t PUREPRE:1;
    uint32_t LONGPRE:1;
    uint32_t :2;
    uint32_t NOBKOFF:1;
    uint32_t BPNOBKOFF:1;
    uint32_t EXCESSDFR:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CFG2bits_t;
extern volatile __EMAC1CFG2bits_t EMAC1CFG2bits __asm__ ("EMAC1CFG2") __attribute__((section("sfrs"), address(0xBF882210)));
#define EMACxCFG2 EMACxCFG2
extern volatile uint32_t   EMACxCFG2 __attribute__((section("sfrs"), address(0xBF882210)));
typedef union {
  struct {
    uint32_t FULLDPLX:1;
    uint32_t LENGTHCK:1;
    uint32_t HUGEFRM:1;
    uint32_t DELAYCRC:1;
    uint32_t CRCENABLE:1;
    uint32_t PADENABLE:1;
    uint32_t VLANPAD:1;
    uint32_t AUTOPAD:1;
    uint32_t PUREPRE:1;
    uint32_t LONGPRE:1;
    uint32_t :2;
    uint32_t NOBKOFF:1;
    uint32_t BPNOBKOFF:1;
    uint32_t EXCESSDFR:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCFG2bits_t;
extern volatile __EMACxCFG2bits_t EMACxCFG2bits __asm__ ("EMACxCFG2") __attribute__((section("sfrs"), address(0xBF882210)));
extern volatile uint32_t        EMAC1CFG2CLR __attribute__((section("sfrs"),address(0xBF882214)));
extern volatile uint32_t        EMACxCFG2CLR __attribute__((section("sfrs"),address(0xBF882214)));
extern volatile uint32_t        EMAC1CFG2SET __attribute__((section("sfrs"),address(0xBF882218)));
extern volatile uint32_t        EMACxCFG2SET __attribute__((section("sfrs"),address(0xBF882218)));
extern volatile uint32_t        EMAC1CFG2INV __attribute__((section("sfrs"),address(0xBF88221C)));
extern volatile uint32_t        EMACxCFG2INV __attribute__((section("sfrs"),address(0xBF88221C)));
#define EMAC1IPGT EMAC1IPGT
extern volatile uint32_t   EMAC1IPGT __attribute__((section("sfrs"), address(0xBF882220)));
typedef union {
  struct {
    uint32_t B2BIPKTGP:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1IPGTbits_t;
extern volatile __EMAC1IPGTbits_t EMAC1IPGTbits __asm__ ("EMAC1IPGT") __attribute__((section("sfrs"), address(0xBF882220)));
#define EMACxIPGT EMACxIPGT
extern volatile uint32_t   EMACxIPGT __attribute__((section("sfrs"), address(0xBF882220)));
typedef union {
  struct {
    uint32_t B2BIPKTGP:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxIPGTbits_t;
extern volatile __EMACxIPGTbits_t EMACxIPGTbits __asm__ ("EMACxIPGT") __attribute__((section("sfrs"), address(0xBF882220)));
extern volatile uint32_t        EMAC1IPGTCLR __attribute__((section("sfrs"),address(0xBF882224)));
extern volatile uint32_t        EMACxIPGTCLR __attribute__((section("sfrs"),address(0xBF882224)));
extern volatile uint32_t        EMAC1IPGTSET __attribute__((section("sfrs"),address(0xBF882228)));
extern volatile uint32_t        EMACxIPGTSET __attribute__((section("sfrs"),address(0xBF882228)));
extern volatile uint32_t        EMAC1IPGTINV __attribute__((section("sfrs"),address(0xBF88222C)));
extern volatile uint32_t        EMACxIPGTINV __attribute__((section("sfrs"),address(0xBF88222C)));
#define EMAC1IPGR EMAC1IPGR
extern volatile uint32_t   EMAC1IPGR __attribute__((section("sfrs"), address(0xBF882230)));
typedef union {
  struct {
    uint32_t NB2BIPKTGP2:7;
    uint32_t :1;
    uint32_t NB2BIPKTGP1:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1IPGRbits_t;
extern volatile __EMAC1IPGRbits_t EMAC1IPGRbits __asm__ ("EMAC1IPGR") __attribute__((section("sfrs"), address(0xBF882230)));
#define EMACxIPGR EMACxIPGR
extern volatile uint32_t   EMACxIPGR __attribute__((section("sfrs"), address(0xBF882230)));
typedef union {
  struct {
    uint32_t NB2BIPKTGP2:7;
    uint32_t :1;
    uint32_t NB2BIPKTGP1:7;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxIPGRbits_t;
extern volatile __EMACxIPGRbits_t EMACxIPGRbits __asm__ ("EMACxIPGR") __attribute__((section("sfrs"), address(0xBF882230)));
extern volatile uint32_t        EMAC1IPGRCLR __attribute__((section("sfrs"),address(0xBF882234)));
extern volatile uint32_t        EMACxIPGRCLR __attribute__((section("sfrs"),address(0xBF882234)));
extern volatile uint32_t        EMAC1IPGRSET __attribute__((section("sfrs"),address(0xBF882238)));
extern volatile uint32_t        EMACxIPGRSET __attribute__((section("sfrs"),address(0xBF882238)));
extern volatile uint32_t        EMAC1IPGRINV __attribute__((section("sfrs"),address(0xBF88223C)));
extern volatile uint32_t        EMACxIPGRINV __attribute__((section("sfrs"),address(0xBF88223C)));
#define EMAC1CLRT EMAC1CLRT
extern volatile uint32_t   EMAC1CLRT __attribute__((section("sfrs"), address(0xBF882240)));
typedef union {
  struct {
    uint32_t RETX:4;
    uint32_t :4;
    uint32_t CWINDOW:6;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CLRTbits_t;
extern volatile __EMAC1CLRTbits_t EMAC1CLRTbits __asm__ ("EMAC1CLRT") __attribute__((section("sfrs"), address(0xBF882240)));
#define EMACxCLRT EMACxCLRT
extern volatile uint32_t   EMACxCLRT __attribute__((section("sfrs"), address(0xBF882240)));
typedef union {
  struct {
    uint32_t RETX:4;
    uint32_t :4;
    uint32_t CWINDOW:6;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCLRTbits_t;
